Revit 2024 API
Form.GetControlPoints Method
Given an edge or a curve or a face, return all control points lying on it (in form of geometry references).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public ReferenceArray GetControlPoints(
	Reference curveOrEdgeOrFaceReference
)
Visual Basic
Public Function GetControlPoints ( _
	curveOrEdgeOrFaceReference As Reference _
) As ReferenceArray
Visual C++
public:
ReferenceArray^ GetControlPoints(
	Reference^ curveOrEdgeOrFaceReference
)
Parameters
curveOrEdgeOrFaceReference
Type: Autodesk.Revit.DB.Reference
The reference of an edge or curve or face.
Return Value
Reference array containing all control points lying on it.
See Also
Form Class
Autodesk.Revit.DB Namespace